{
"About": {
  "Name": "Cameren Banis",
  "Currently": "Electrical Engineering Student",
  "Headshot": "student-portrait.jpg",
  "Thumbnail": "student-logo.webp",
  "AboutText": "Hi, I am Cameren Banis. I am a passionate electrical engineering student with a keen interest in PCB design, power electronics, and control systems. Currently, I am pursuing my undergraduate degree at Seattle Pacific University. I am dedicated to expanding my knowledge and skills in various areas of electrical engineering, with a particular focus on power systems.<br><br>I enjoy working in a collaborative environment where I am able to tackle problems with my fellow peers, learning new things with every problem that arises.<br><br>Beyond the classroom, I am the acting IEEE chair at Seattle Pacific University, which allows me to explore various different fields in electrical engineering and learn about the evolving industry from their expertise. I believe in the importance of continuous learning and seek out opportunities to explore new technologies and methodologies."
},
"Contact": {
  "Email": "baniscameren@gmail.com",
  "Phone": "(808) 228-6982",
  "Portfolio": "https://github.com/Banisc19/banis-cameren.github.io",
  "LinkedIn": "https://linkedin.com",
  "GitHub": "https://github.com"
},
"Experience": {
  "ExperienceText": "Use this area to explain how you got to where you are and what you are currently doing now.<br><br>This is a good spot to talk yourself up.",
  "School": "Seattle Pacific University",
  "Major": "Electrical Engineering BSc",
  "Graduation": "June 2026",
  "EducationText": "Use this to add some narrative to your education section",
  "Employment": "Seattle Pacific University",
  "Role": "Physics Learning Assistant",
  "EmploymentText": "Use this to add some narrative to your employment section",
  "Skills": ["C++", "Multisim", "Oscilloscopes", "Power Supplies", "Altium PCB Design", "LTSpice", "Excel"],
  "SkillsText": "Use this to add some narrative to your skills section",
  "Resume/CV": "student-resume.pdf"  
},
"Project1": {
    "Title": "Frequency Detector Design Project",
    "Desc": "Student designed frequency detector that operates to attenuate frequency outside 25 kHz<br>and demonstrates operation through physical and analog data",
    "ProjectFile": "https://drive.google.com/file/d/1WVxoNiicFmQ1xgjixCOcSrAsatM43L9B/view?usp=sharing",
    "MainImage": "P1Main.png",
    "DetailImages": ["P1Detail1.png","P1Detail2.png","P1Detail3.png"]
  },
  "Project2": {
    "Title": "Dual Adjustable Power Supply with Different Voltage Levels",
    "Desc": "This is a description of Project Two.<br><br>It also has a GitHub repo and more details shown in screenshots.",
    "GitHubRepo": "https://github.com",
    "MainImage": "P2Main.png",
    "DetailImages": ["P2Detail1.png","P2Detail2.png","P2Detail3.png","P2Detail4.png"]
  },
  "Project3": {
    "Title": "Integrated PCB Design for Multi-Trim Automotive Systems",
    "Desc": "This is a description of Project Three.<br><br>It does not have a GitHub repo or any additional screenshots.",
    "GitHubRepo": "",
    "MainImage": "P3Main.png",
    "DetailImages": []
  },
  "Project4": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  }
}
